TELEGRAM_SERVICE_ID = "api.djp.telemetry"
TELEGRAM_CHANNEL = "ejp"
TELEGRAM_PDATA_ID = "ejp.sakhi.api.service"

LANGUAGE_SELCTION = {
    "en": """
*Health Guru AI*
I am here to help you  to provide young people with accurate and comprehensive information about their bodies, sexuality, and relationships.
""",
    "hi": """
*स्वास्थ्य गुरु एआई*
मैं यहाँ आपकी सहायता करने के लिए हूँ ताकि युवा लोगों को उनके शरीर, यौनता और रिश्तों के बारे में सटीक और व्यापक जानकारी प्रदान कर सकूं।

""",
    "bn": """
*স্বাস্থ্য গুরু এআই*
আমি এখানে আপনাকে সাহায্য করতে এসেছি যাতে যুবকরা তাদের শরীর, যৌনতা এবং সম্পর্ক সম্পর্কে সঠিক এবং বিস্তৃত তথ্য পেতে পারে।

""",
    "gu": """
*હેલ્થ ગુરુ એઆઈ*
હું તમારી મદદ કરવા માટે અહીં છું, જેથી યુવાનોને તેમના શરીર, લૈંગિકતા અને સંબંધો વિશે ચોક્કસ અને વ્યાપક માહિતી મળી શકે.

""",
    "kn": """
*ಹೆಲ್ತ್ ಗುರು ಎಐ*
ನಾನು ನಿಮಗೆ ಸಹಾಯ ಮಾಡಲು ಇಲ್ಲಿದ್ದೇನೆ, ಇದರಿಂದ ಯುವಕರಿಗೆ ಅವರ ದೇಹ, ಲೈಂಗಿಕತೆ ಮತ್ತು ಸಂಬಂಧಗಳ ಕುರಿತು ಸರಿಯಾದ ಮತ್ತು ಸಮಗ್ರ ಮಾಹಿತಿಯನ್ನು ನೀಡಲು.

""",
    "ml": """
*ഹെൽത്ത് ഗുരു എഐ*
ഞാൻ ഇവിടെ നിങ്ങളുടെ സഹായത്തിനാണ്, ചെറുപ്പക്കാർക്ക് അവരുടെ ശരീരം, ലൈംഗികത, ബന്ധങ്ങൾ എന്നിവയുമായി ബന്ധപ്പെട്ട ശുദ്ധവും സമഗ്രവുമായ വിവരങ്ങൾ ലഭ്യമാക്കാൻ.

""",
    "mr": """
*हेल्थ गुरु एआय*
मी इथे तुमची मदत करण्यासाठी आहे, जेणेकरून तरुणांना त्यांच्या शरीराबद्दल, लैंगिकतेबद्दल आणि नातेसंबंधांबद्दल अचूक आणि व्यापक माहिती मिळू शकेल.

""",
    "or": """
*ହେଲ୍ଥ ଗୁରୁ ଏଆଇ*
ମୁଁ ଯୁବ ପିଲାଙ୍କୁ ତାଙ୍କର ଦେହ, ଯୌନତା ଓ ସମ୍ପର୍କ ବିଷୟରେ ସଠିକ୍ ଓ ବ୍ୟାପକ ତଥ୍ୟ ପ୍ରଦାନ କରିବାକୁ ଆପଣଙ୍କୁ ସାହାଯ୍ୟ କରିବା ପାଇଁ ଏଠାରେ ଅଛି।

""",
    "pa": """
*ਹੈਲਥ ਗੁਰੂ ਏਆਈ*
ਮੈਂ ਤੁਹਾਡੀ ਮਦਦ ਕਰਨ ਲਈ ਇੱਥੇ ਹਾਂ ਤਾਂ ਜੋ ਨੌਜਵਾਨਾਂ ਨੂੰ ਉਨ੍ਹਾਂ ਦੇ ਸਰੀਰਾਂ, ਯੌਨਤਾ ਅਤੇ ਸਬੰਧਾਂ ਬਾਰੇ ਸਹੀ ਅਤੇ ਵਿਸਤ੍ਰਿਤ ਜਾਣਕਾਰੀ ਪ੍ਰਦਾਨ ਕੀਤੀ ਜਾ ਸਕੇ।

""",
    "ta": """
*ஆரோக்கிய குரு ஏஐ*
இளம் மக்களுக்கு அவர்களின் உடல், பாலியல் மற்றும் உறவுகள் பற்றிய துல்லியமான மற்றும் விரிவான தகவலை வழங்க நான் இங்கே உங்களுக்கு உதவ இருக்கிறேன்.
""",
    "te": """
*హెల్త్ గురు ఏఐ*
నేను యువతకు వారి శరీరాలు, లైంగికత మరియు సంబంధాల గురించి సరిగ్గా మరియు సమగ్రంగా సమాచారం అందించడానికి మీకు సహాయపడటానికి ఇక్కడ ఉన్నాను.

"""
}

BOT_NAME = {
    "en": {
        "story": "Katha Sakhi",
        "teacher": "Teacher Tara",
        "parent": "Parent Tara",
        "early_child_development_bot": "ECD AI",
        "prayas":"Prayas AI"
    },
    "hi": {
        "story": "कथा सखी",
        "teacher": "टीचर तारा",
        "parent": "पेरेंट तारा",
        "prayas":"प्रयास एआई"

    },
    "bn": {
        "story": "কথা সখি",
        "teacher": "শিক্ষক তারা",
        "parent": "অভিভাৱক তারা",
        "prayas":"প্রয়াস এআই"

    },
    "gu": {
        "story": "વાર્તા સખી",
        "teacher": "શિક્ષક તારા",
        "parent": "પિતૃ તારા",
        "prayas":"પ્રયાસ એઆઈ"

        
    },
    "kn": {
        "story": "ಕಥಾ ಸಖಿ",
        "teacher": "ಶಿಕ್ಷಕಿ ತಾರಾ",
        "parent": "ಪೋಷಕ ತಾರಾ",
        "prayas":"ಪ್ರಯಾಸ್ ಎಐ"

    },
    "ml": {
        "story": "കഥാ സുഹൃത്ത്",
        "teacher": "ടീച്ചർ താര",
        "parent": "മാതാവ് താര",
        "prayas":"പ്രയാസ് എഐ"

    },
    "mr": {
        "story": "कथा सखी",
        "teacher": "टीचर तारा",
        "parent": "पेरेंट तारा",
        "prayas":"प्रयास एआय"

    },
    "or": {
        "story": "କାହାଣୀ ସଖୀ |",
        "teacher": "ଶିକ୍ଷକ ତାରା |",
        "parent": "ପିତାମାତା ତାରା |",
        "prayas":"ପ୍ରୟାସ ଏଆଇ |"

    },
    "pa": {
        "story": "ਕਥਾ ਸਾਖੀ",
        "teacher": "ਅਧਿਆਪਕ ਤਾਰਾ",
        "parent":  "ਮਾਪੇ ਤਾਰਾ",
        "prayas":"ਪ੍ਰਯਾਸ ਏਆਈ"

    },
    "ta": {
        "story": "கதை சகி",
        "teacher": "ஆசிரியர் தாரா",
        "parent": "தாய் தாரா"
    },
    "te": {
        "story": "కథా సఖి",
        "teacher": "టీచర్ తార",
        "parent": "పేరెంట్ తార",
        "prayas":"ప్రయాస్ ఏఐ"

    }
}

BOT_SELECTION = {
    "en": {
        "story": """
Wecome to *Katha Sakhi!*
I can create a new story about whatever you ask for. 

For example you can ask: 
- Tell a story about a child prodigy
- Tell a story about a girl who loves her mom
- Tell a story about a Monkey and a Frog

Ask me what story do you want. You can type or speak.
        """,
        "teacher": """
Wecome to *Teacher Tara!*
I can suggest you activities that you can do with your students (of age 3 to 8 years) at schools. 
I can also answer your questions about the play based learning suggested in the new NCF for Foundational Stage.
Here are few examples of what you can ask.

Examples:
- What activity can I do with students to teach sorting or counting numbers
- How can I conduct my class with children with special needs
- What can I do to engage a child who is always distracted.

I can answer your questions about the new NCF
Ask me about anything that you want. You can type or speak.
        """,
        "parent": """
Wecome to *Parent Tara!*
I can suggest you activities that you can do with your children at home. It can also suggest how to handle certain situations with your child.

Here are few examples of what you can ask:
- My child gets irritated easily. What should I do?
- What activity can I do with my child using vegetables in my kitchen ?
- Suggest how I can make my child interested in household activities
- My child is not physically active. He only plays game on mobile

Ask me about anything that you want me to suggest. You can type or speak.
        """,
        "early_child_development_bot": """
Wecome to *ECD AI!*
I can suggest you activities that you can do with your children at home. It can also suggest how to handle certain situations with your child.

Here are few examples of what you can ask:
- My child gets irritated easily. What should I do?
- What activity can I do with my child using vegetables in my kitchen ?
- Suggest how I can make my child interested in household activities
- My child is not physically active. He only plays game on mobile

Ask me about anything that you want me to suggest. You can type or speak.
        """,
        "prayas": """
Welcome to Prayas AI Assistant!
I can help you with learning about your body, understanding changes during puberty, and finding support for emotional and sexual health.
Here are a few examples of what you can ask:
-What changes should I expect during puberty?
-How can I stay clean and healthy as I grow?
-Where can I find counseling for emotional problems?
-What are the best practices for menstrual hygiene?

Ask me about anything that you want me to suggest. You can type or speak.
"""
    },
    "hi": {
        "story": """
*कथा सखी* में आपका स्वागत है!
आप जो मांगेंगे उसके बारे में मैं आपके लिए एक कहानी बना सकता हूं।

उदाहरण के लिए आप पूछ सकते हैं:
- एक प्रतिभाशाली बच्चे के बारे में एक कहानी बताओ
- एक ऐसी लड़की के बारे में कहानी बताओ जो अपनी माँ से प्यार करती है
- एक बंदर और मेंढक के बारे में एक कहानी बताओ

आप जो चाहते हो वो मुझसे पूछ सकते हैं। आप टाइप कर सकते हैं या बोल सकते हैं।
""",
        "teacher": """
*टीचर तारा* में आपका स्वागत है!
मैं आपको ऐसी गतिविधियाँ सुझा सकता हूँ जो आप स्कूलों में अपने छात्रों (3 से 8 वर्ष की आयु के) के साथ कर सकते हैं।
मैं फाउंडेशनल स्टेज के लिए नए एनसीएफ में सुझाए गए खेल आधारित शिक्षण के बारे में आपके सवालों का जवाब भी दे सकता हूं।
यहां कुछ उदाहरण दिए गए हैं कि आप क्या पूछ सकते हैं।

उदाहरण:
- संख्याओं को क्रमबद्ध करना या गिनना सिखाने के लिए मैं विद्यार्थियों के साथ कौन सी गतिविधि कर सकता हूँ?
- मैं विशेष आवश्यकता वाले बच्चों के साथ अपनी कक्षा कैसे संचालित कर सकता हूँ?
- मैं उस बच्चे को व्यस्त रखने के लिए क्या कर सकता हूं जो हमेशा विचलित रहता है?
- मैं नए एनसीएफ के बारे में आपके सवालों का जवाब दे सकता हूं

आप जो चाहते हो वो मुझसे पूछ सकते हैं। आप टाइप कर सकते हैं या बोल सकते हैं।
        """,
        "parent": """
*पेरेंट तारा* में आपका स्वागत है!
मैं आपको ऐसी गतिविधियाँ सुझा सकता हूँ जो आप घर पर अपने बच्चों के साथ कर सकते हैं। यह यह भी सुझाव दे सकता है कि अपने बच्चे के साथ कुछ स्थितियों को कैसे संभालें।

यहां कुछ उदाहरण दिए गए हैं कि आप क्या पूछ सकते हैं:
- मेरा बच्चा जल्दी चिड़चिड़ा हो जाता है। मुझे क्या करना चाहिए?
- मैं अपनी रसोई में सब्जियों का उपयोग करके अपने बच्चे के साथ कौन सी गतिविधि कर सकता हूँ?
- सुझाव दें कि मैं अपने बच्चे को घरेलू गतिविधियों में कैसे दिलचस्पी ले सकता हूं
- मेरा बच्चा शारीरिक रूप से सक्रिय नहीं है। वह सिर्फ मोबाइल पर गेम खेलता है

मुझसे किसी भी चीज़ के बारे में पूछें जो आप चाहते हैं कि मैं सुझाव दूं। आप टाइप कर सकते हैं या बोल सकते हैं.
""",
    "prayas": """
प्रयास एआई सहायक में आपका स्वागत है!
मैं आपके शरीर के बारे में जानने, युवावस्था के दौरान होने वाले परिवर्तनों को समझने और भावनात्मक और यौन स्वास्थ्य के लिए समर्थन खोजने में आपकी मदद कर सकता हूँ।
यहाँ कुछ उदाहरण दिए गए हैं जिनके बारे में आप पूछ सकते हैं:
-युवावस्था के दौरान मुझे कौन-कौन से परिवर्तन देखने को मिलेंगे?
-जैसे-जैसे मैं बड़ा हो रहा हूँ, मैं साफ-सुथरा और स्वस्थ कैसे रह सकता हूँ?
-मुझे भावनात्मक समस्याओं के लिए परामर्श कहाँ मिल सकता है?
-मासिक धर्म स्वच्छता के लिए सर्वोत्तम प्रथाएँ क्या हैं?

आप मुझसे कुछ भी पूछ सकते हैं जिसके बारे में आप सुझाव चाहते हैं। आप टाइप या बोल सकते हैं।
"""

    },
    "bn": {
        "story": """
কথা সখিতে স্বাগতম!
আপনি যা চাইছেন তা নিয়ে আমি আপনার জন্য একটি গল্প তৈরি করতে পারি।
 
উদাহরণ স্বরূপ:
- আমি একটি মেয়ের গল্প বলতে পারি যে প্রথমবার সমুদ্র দেখেছিল।
- আমি একটি বানর এবং একটি ব্যাঙ সম্পর্কে একটি গল্প বলতে পারি
 
আপনি চান যে কিছু সম্পর্কে আমাকে জিজ্ঞাসা করুন. আপনি টাইপ বা কথা বলতে পারেন।
""",
        "teacher": """
শিক্ষক তারাকে স্বাগতম!
আমি আপনাকে এমন ক্রিয়াকলাপের পরামর্শ দিতে পারি যা আপনি স্কুলে আপনার ছাত্রদের (3 থেকে 8 বছর বয়সী) সাথে করতে পারেন।
ফাউন্ডেশনাল স্টেজের জন্য নতুন NCF-এ প্রস্তাবিত নাটক ভিত্তিক শিক্ষার বিষয়েও আমি আপনার প্রশ্নের উত্তর দিতে পারি।
আপনি যা জিজ্ঞাসা করতে পারেন তার কয়েকটি উদাহরণ এখানে রয়েছে।

উদাহরণ:
- বাছাই করা বা সংখ্যা গণনা শেখানোর জন্য আমি শিক্ষার্থীদের সাথে কী কার্যকলাপ করতে পারি
- আমি কিভাবে বিশেষ চাহিদা সম্পন্ন শিশুদের সাথে আমার ক্লাস পরিচালনা করতে পারি
- আমি কি করতে পারি এমন একটি শিশুকে নিযুক্ত করতে যা সবসময় বিভ্রান্ত হয়।

আমি নতুন NCF সম্পর্কে আপনার প্রশ্নের উত্তর দিতে পারি
আপনি চান যে কিছু সম্পর্কে আমাকে জিজ্ঞাসা করুন. আপনি টাইপ বা কথা বলতে পারেন।
""",
        "parent": """
পিতা মাতা তারার কাছে স্বাগতম!
আমি আপনাকে এমন কার্যকলাপের পরামর্শ দিতে পারি যা আপনি বাড়িতে আপনার বাচ্চাদের সাথে করতে পারেন। আপনি যা জিজ্ঞাসা করতে পারেন তার কয়েকটি উদাহরণ এখানে রয়েছে:
 
উদাহরণ:
- আপনার রান্নাঘরে শাকসবজি ব্যবহার করে আমি আমার সন্তানের সাথে কী কাজ করতে পারি
- আমি কীভাবে আমার সন্তানকে গৃহস্থালীর কাজে আগ্রহী করে তুলতে পারি তার পরামর্শ দিন
- আমার সন্তান পুষ্টিকর খাবার খায় না, কী করব
 
আপনি চান যে কিছু সম্পর্কে আমাকে জিজ্ঞাসা করুন. আপনি টাইপ বা কথা বলতে পারেন।
""",
        "prayas": """
প্রয়াস এআই সহায়কতে স্বাগতম!
আমি আপনাকে আপনার শরীর সম্পর্কে শেখা, বয়ঃসন্ধির সময় পরিবর্তনগুলি বোঝা এবং মানসিক ও যৌন স্বাস্থ্যের জন্য সহায়তা খুঁজে পেতে সহায়তা করতে পারি।
আপনি যা জিজ্ঞাসা করতে পারেন তার কয়েকটি উদাহরণ এখানে দেওয়া হল:
-বয়ঃসন্ধির সময় আমি কী কী পরিবর্তন আশা করতে পারি?
-বড় হওয়ার সাথে সাথে কীভাবে পরিষ্কার এবং স্বাস্থ্যকর থাকতে পারি?
-মানসিক সমস্যার জন্য পরামর্শ কোথায় পাব?
-মাসিক স্বাস্থ্যবিধির জন্য সেরা পদ্ধতিগুলি কী কী?

আপনি আমাকে যেকোনো কিছু জিজ্ঞাসা করতে পারেন যা আপনি জানতে চান। আপনি টাইপ বা বলতে পারেন।
"""

    },
    "gu": {
        "story": """
*વાર્તા સખીમાં* આપનું સ્વાગત છે!
તમે જે માગો છો તેના વિશે હું તમારા માટે વાર્તા બનાવી શકું છું.

દાખલા તરીકે:
- હું એક છોકરી વિશે વાર્તા કહી શકું જેણે પ્રથમ વખત સમુદ્ર જોયો.
- હું વાનર અને દેડકા વિશે વાર્તા કહી શકું છું
 
તમને જે જોઈએ તે વિશે મને પૂછો. તમે ટાઈપ કરી શકો છો અથવા બોલી શકો છો.
""",
        "teacher": """
*શિક્ષક તારામાં* આપનું સ્વાગત છે!
હું તમને એવી પ્રવૃત્તિઓ સૂચવી શકું છું જે તમે શાળાઓમાં તમારા વિદ્યાર્થીઓ (૩ થી ૮ વર્ષની વયના) સાથે કરી શકો.
પાયાના તબક્કા માટે નવા NCF માં સૂચવેલા નાટક આધારિત શિક્ષણ વિશે હું તમારા પ્રશ્નોના જવાબ પણ આપી શકું છું.
અહીં તમે શું પૂછી શકો તેના થોડા ઉદાહરણો છે.

ઉદાહરણો:
- વર્ગીકરણ અથવા સંખ્યાઓ ગણવાનું શીખવવા માટે હું વિદ્યાર્થીઓ સાથે કઈ પ્રવૃત્તિ કરી શકું?
- હું ખાસ જરૂરિયાતો ધરાવતા બાળકો સાથે મારો વર્ગ કેવી રીતે ચલાવી શકું?
- જે બાળક હંમેશા વિચલિત રહે છે તેને જોડવા માટે હું શું કરી શકું?

હું નવા NCF વિશે તમારા પ્રશ્નોના જવાબ આપી શકું છું.
તમને જે જોઈએ તે વિશે મને પૂછો. તમે ટાઈપ કરી શકો છો અથવા બોલી શકો છો.
""",
        "parent": """
*પિતૃ તારામાં* આપનું સ્વાગત છે!
હું તમને એવી પ્રવૃત્તિઓ સૂચવી શકું છું જે તમે તમારા બાળકો સાથે ઘરે કરી શકો. અહીં તમે શું પૂછી શકો તેના થોડા ઉદાહરણો છે:

ઉદાહરણો:
- તમારા રસોડામાં શાકભાજીનો ઉપયોગ કરીને હું મારા બાળક સાથે કઈ પ્રવૃત્તિ કરી શકું?
- હું મારા બાળકને ઘરની પ્રવૃત્તિઓમાં રસ કેવી રીતે કેળ​વી શકું તે સૂચવો.
- મારું બાળક પૌષ્ટિક ખોરાક નથી ખાતું, શું કરવું ?

તમને જે જોઈએ તે વિશે મને પૂછો. તમે ટાઈપ કરી શકો છો અથવા બોલી શકો છો.
""",
        "prayas": """
પ્રયાસ એઆઈ સહાયકમાં આપનું સ્વાગત છે!
હું તમને તમારા શરીર વિશે શીખવામાં, યુવાની દરમિયાન આવતા ફેરફારો સમજવામાં, અને ભાવનાત્મક અને જાતીય આરોગ્ય માટે સમર્થન મેળવવામાં મદદ કરી શકું છું.
અહિં કેટલીક ઉદાહરણો છે જે તમે પૂછવા માંગો છો:
-યુવાની દરમિયાન કયા ફેરફારોની અપેક્ષા રાખવી જોઈએ?
-જ્યારે હું મોટો થાઉં, ત્યારે હું સ્વચ્છ અને સ્વસ્થ કેવી રીતે રહી શકું?
-ભાવનાત્મક સમસ્યાઓ માટે કાઉન્સેલિંગ ક્યાં મળી શકે?
-માસિક સ્વચ્છતાના શ્રેષ્ઠ અભ્યાસ શું છે?

તમે મને કશું પણ પૂછો જે તમે મને સૂચવવા માંગો છો. તમે ટાઇપ કરી શકો છો અથવા બોલી શકો છો.
"""

    },
    "kn": {
        "story": """
ಕಥಾ ತಾರಾಗೆ ಸ್ವಾಗತ ! 
ನೀವು ಕೇಳಿದ ವಿಷಯದ ಬಗ್ಗೆ ನಾನು ನಿಮಗಾಗಿ ಕಥೆಯನ್ನು ರಚಿಸಿ ಕೊಡಬಲ್ಲೆ.

ಉದಾಹರಣೆಗೆ: 
- ಸಮುದ್ರವನ್ನು ಮೊದಲ ಬಾರಿಗೆ ನೋಡಿದ ಹುಡುಗಿಯ ಬಗ್ಗೆ ನಾನು ಒಂದು ಕಥೆಯನ್ನು ಹೇಳಬಲ್ಲೆ.
- ಮಂಗ ಮತ್ತು ಕಪ್ಪೆಯ ಬಗ್ಗೆ ಒಂದು ಕಥೆಯನ್ನು ಹೇಳಬಲ್ಲೆ. ನಿಮಗೆ ಏನು ಬೇಕೋ ಅದನ್ನು ಕೇಳಿ. 

ನೀವು ಟೈಪ್ ಮಾಡಬಹುದು ಅಥವಾ ಮಾತನಾಡಬಹುದು.
""",
        "teacher": """
ಶಿಕ್ಷಕ ತಾರಾಗೆ ಸ್ವಾಗತ!
(3 ರಿಂದ 8 ವರ್ಷ ವಯಸ್ಸಿನ) ನಿಮ್ಮ ವಿದ್ಯಾರ್ಥಿಗಳೊಂದಿಗೆ ಶಾಲೆಯಲ್ಲಿ ನೀವು ಮಾಡಬಹುದಾದ ಚಟುವಟಿಕೆಗಳನ್ನು ನಾನು ಸಲಹೆ ಮಾಡಬಲ್ಲೆ. 
ಬುನಾದಿ ಹಂತದ ಹೊಸ ಎನ್.ಸಿ.ಎಫ್. ಸಲಹೆ ಮಾಡಿರುವ ಪ್ಲೇ ಆಧರಿತ ಕಲಿಕೆಗೆ ಸಂಬಂಧಿಸಿದ ನಿಮ್ಮ ಪ್ರಶ್ನೆಗಳಿಗೂ ಉತ್ತರಿಸಬಲ್ಲೆ. 

ನೀವು ಕೇಳಬಹುದಾದ ಕೆಲವು ಪ್ರಶ್ನೆಗಳ ಉದಾಹರಣೆ ಇಲ್ಲಿದೆ: 
- ಸಂಖ್ಯೆಗಳನ್ನು ವಿಂಗಡಿಸುವ , ಎಣಿಸುವ ಪಾಠ ಕಲಿಸಲು ಯಾವ ಚಟುವಟಿಕೆಯನ್ನು ನಡೆಸಲಿ? 
- ವಿಶೇಷ ಅಗತ್ಯಗಳ ವಿದ್ಯಾರ್ಥಿಗಳು ಇರುವ ನನ್ನ ತರಗತಿಯನ್ನು ನಾನು ಹೇಗೆ ನಿರ್ವಹಿಸಲಿ? 
- ಯಾವಾಗಲೂ ಚಂಚಲವಾಗಿರುವ ಮಕ್ಕಳನ್ನು ತೊಡಗಿಸಿಕೊಳ್ಳಲು ಏನು ಮಾಡಲಿ? ಹೊಸ 

ಎನ್.ಸಿ.ಎಫ್. ಬಗ್ಗೆ ನಿಮ್ಮ ಪ್ರಶ್ನೆಗಳಿಗೆ ಉತ್ತರಿಸಬಲ್ಲೆ. 
ನಿಮಗೆ ಏನು ಬೇಕೋ ಅದನ್ನು ಕೇಳಿ. ನೀವು ಟೈಪ್ ಮಾಡಬಹುದು ಅಥವಾ ಮಾತಾಡಬಹುದು.
""",
        "parent": """
ಪೋಷಕ ಸಖಿಗೆ ಸ್ವಾಗತ!
ಮನೆಯಲ್ಲಿ ನಿಮ್ಮ ಮಕ್ಕಳೊಂದಿಗೆ ನೀವು ಮಾಡಬಹುದಾದ ಚಟುವಟಿಕೆಗಳನ್ನು ನಾನು ನಿಮಗೆ ಸೂಚಿಸಬಲ್ಲೆ. ನೀವು ಕೇಳಬಹುದಾದ ಕೆಲವು ಉದಾಹರಣೆಗಳು ಇಲ್ಲಿವೆ:

ಉದಾಹರಣೆಗಳು:
- ನನ್ನ ಅಡುಗೆಮನೆಯಲ್ಲಿ ತರಕಾರಿಗಳನ್ನು ಬಳಸಿಕೊಂಡು ಮಗುವಿನೊಂದಿಗೆ ನಾನು ಯಾವ ಚಟುವಟಿಕೆಯನ್ನು ಮಾಡಬಹುದು?
- ನನ್ನ ಮಗುವಿಗೆ ಮನೆಯ ಚಟುವಟಿಕೆಗಳಲ್ಲಿ ಆಸಕ್ತಿಯನ್ನು ಹೇಗೆ ಮೂಡಿಸಬಹುದು ಎಂಬುದನ್ನು ಸೂಚಿಸಿ.
- ನನ್ನ ಮಗು ಪೌಷ್ಟಿಕ ಆಹಾರವನ್ನು ತಿನ್ನುವುದಿಲ್ಲ, ಏನು ಮಾಡಬೇಕು?

ನಿಮಗೆ ಏನು ಬೇಕೋ ಅದರ ಬಗ್ಗೆ ನನ್ನನ್ನು ಕೇಳಿ. ನೀವು ಟೈಪ್ ಮಾಡಬಹುದು ಅಥವಾ ಮಾತನಾಡಬಹುದು.
""",
        "prayas": """
ಪ್ರಯಾಸ್ ಎಐ ಸಹಾಯಕಕ್ಕೆ ಸ್ವಾಗತ!
ನಾನು ನಿಮ್ಮ ದೇಹವನ್ನು ಕಲಿಯಲು, ಯೌವನಾವಸ್ಥೆಯ ವೇಳೆ ಬದಲಾವಣೆಗಳನ್ನು ಅರ್ಥಮಾಡಿಕೊಳ್ಳಲು, ಮತ್ತು ಭಾವನಾತ್ಮಕ ಮತ್ತು ಲೈಂಗಿಕ ಆರೋಗ್ಯಕ್ಕಾಗಿ ಬೆಂಬಲವನ್ನು ಹುಡುಕಲು ನಿಮಗೆ ಸಹಾಯ ಮಾಡಬಹುದು.
ನೀವು ಕೇಳಬಹುದಾದ ಕೆಲವು ಉದಾಹರಣೆಗಳು ಇಲ್ಲಿವೆ:
-ಯೌವನಾವಸ್ಥೆಯ ಸಮಯದಲ್ಲಿ ನಾನು ಯಾವ ಬದಲಾವಣೆಗಳನ್ನು ನಿರೀಕ್ಷಿಸಬೇಕು?
-ನಾನು ಬೆಳೆಯುವಂತೆ ನಾನು ಹೇಗೆ ಸ್ವಚ್ಛವಾಗಿರಬಹುದು ಮತ್ತು ಆರೋಗ್ಯವಾಗಿರಬಹುದು?
-ಭಾವನಾತ್ಮಕ ಸಮಸ್ಯೆಗಳಿಗಾಗಿ ನಾನು ಎಲ್ಲಿ ಕೌನ್ಸೆಲಿಂಗ್ ಪಡೆಯಬಹುದು?
-ಮಾಸಿಕ ಸ್ವಚ್ಛತೆಗಾಗಿ ಉತ್ತಮ ಅಭ್ಯಾಸಗಳು ಯಾವುವು?

ನೀವು ನನಗೆ ಯಾವುದಾದರೂ ವಿಷಯವನ್ನು ಕೇಳಬಹುದು, ನೀವು ಟೈಪ್ ಮಾಡಬಹುದು ಅಥವಾ ಮಾತನಾಡಬಹುದು.
"""

    },
    "ml": {
        "story": """
കഥാസുഹൃത്തിലേക്ക് സ്വാഗതം !
നിങ്ങൾ ആവശ്യപ്പെടുന്നപോലെ ഞാൻ നിങ്ങൾക്കായി ഒരു കഥ സൃഷ്ടിക്കാം.

ഉദാഹരണത്തിന്:
- ആദ്യമായി കടൽ കണ്ട ഒരു പെൺകുട്ടിയുടെ കഥ ഞാൻ പറയാം. കുരങ്ങിനെയും തവളയെയും കുറിച്ച് ഒരു കഥ ഞാൻപറയാം
- നിങ്ങൾക്ക് ആവശ്യമുള്ളതെന്തും എന്നോട് ചോദിക്കാം. 

നിങ്ങൾക്ക് ടൈപ്പ് ചെയ്യുകയോ സംസാരിക്കുകയോ ആവാം.
""",
        "teacher": """
അധ്യാപകസുഹൃത്തിലേക്ക് സ്വാഗതം!
നിങ്ങളുടെ വിദ്യാർത്ഥികളുമായി (3 മുതൽ 8 വയസ്സ് വരെ) സ്കൂളുകളിൽ നിങ്ങൾക്ക് ചെയ്യാൻ കഴിയുന്ന പ്രവർത്തനങ്ങൾ എനിക്ക് നിർദ്ദേശിക്കാനാകും.
ഫൗണ്ടേഷണൽ സ്റ്റേജിലേക്ക് പുതിയ NCF-ൽ നിർദ്ദേശിച്ചിരിക്കുന്ന കളി അടിസ്ഥാനമാക്കിയുള്ള പഠനത്തെക്കുറിച്ചുള്ള നിങ്ങളുടെ ചോദ്യങ്ങൾക്ക് എനിക്ക് ഉത്തരം നൽകാനും കഴിയും.
നിങ്ങൾക്ക് ചോദിക്കാനാകുന്ന ചില ഉദാഹരണങ്ങൾ ഇതാ.

ഉദാഹരണങ്ങൾ:
- അക്കങ്ങൾ അടുക്കുന്നതിനോ എണ്ണുന്നതിനോ പഠിപ്പിക്കാൻ വിദ്യാർത്ഥികളുമായി എനിക്ക് എന്ത് പ്രവർത്തനമാണ് ചെയ്യാൻ കഴിയുക
- പ്രത്യേക ശ്രദ്ധവേണ്ട കുട്ടികളുമായി എനിക്ക് എങ്ങനെ എന്റെ ക്ലാസ് നടത്താനാകും
- എപ്പോഴും അശ്രദ്ധയോടെയിരിക്കുന്ന ഒരു കുട്ടിയുമായി ഇടപഴകുന്നതിന് എനിക്ക് എന്തുചെയ്യാൻ കഴിയും.

പുതിയ NCF നെക്കുറിച്ചുള്ള നിങ്ങളുടെ ചോദ്യങ്ങൾക്ക് എനിക്ക് ഉത്തരം നൽകാൻ കഴിയും
നിങ്ങൾക്ക് ആവശ്യമുള്ളതെന്തും എന്നോട് ചോദിക്കാം. നിങ്ങൾക്ക് ടൈപ്പ് ചെയ്യുകയോ സംസാരിക്കുകയോ ആവാം
""",
        "parent": """
രക്ഷാകർതൃ സുഹൃത്തിലേക്ക് സ്വാഗതം!
നിങ്ങളുടെ കുട്ടികളുമായി വീട്ടിലിരുന്ന് ചെയ്യാൻ കഴിയുന്ന പ്രവർത്തനങ്ങൾ ഞാൻ നിർദ്ദേശിക്കാം. 
നിങ്ങൾക്ക് ചോദിക്കാൻ കഴിയുന്നതിന്റെ കുറച്ച് ഉദാഹരണങ്ങൾ ഇതാ:

ഉദാഹരണങ്ങൾ:
- നിങ്ങളുടെ അടുക്കളയിൽ പച്ചക്കറികൾ ഉപയോഗിച്ച് എന്റെ കുട്ടിയുമായി എനിക്ക് എന്ത് പ്രവർത്തനമാണ് ചെയ്യാൻ കഴിയുക
- വീട്ടുജോലികളിൽ എന്റെ കുട്ടിക്ക് എങ്ങനെ താൽപ്പര്യമുണ്ടാക്കാമെന്ന് നിർദ്ദേശിക്കുക
- എന്റെ കുട്ടി പോഷകാഹാരം കഴിക്കുന്നില്ല, എന്തുചെയ്യും

നിങ്ങൾക്ക് ആവശ്യമുള്ളതെന്തും എന്നോട് ചോദിക്കാം. നിങ്ങൾക്ക് ടൈപ്പ് ചെയ്യുകയോ സംസാരിക്കുകയോ ആവാം.
""",
        "prayas": """
പ്രയാസ് എഐ അസിസ്റ്റന്റിലേക്ക് സ്വാഗതം!
നിങ്ങളുടെ ശരീരത്തെക്കുറിച്ച് പഠിക്കുന്നതിൽ, കൗമാരപ്രായത്തിൽ സംഭവിക്കുന്ന മാറ്റങ്ങളെക്കുറിച്ച് മനസ്സിലാക്കുന്നതിൽ, മാനസികവും ലൈംഗികവുമായ ആരോഗ്യംക്കായി പിന്തുണ കണ്ടെത്തുന്നതിലും ഞാൻ നിങ്ങളെ സഹായിക്കാം.
നിങ്ങൾ ചോദിക്കാൻ കഴിയുന്ന ചില ഉദാഹരണങ്ങൾ ഇവിടെ നൽകിയിരിക്കുന്നു:
-കൗമാരപ്രായത്തിൽ എനിക്ക് എന്തെല്ലാം മാറ്റങ്ങൾ പ്രതീക്ഷിക്കാം?
-ഞാൻ വളരുമ്പോൾ എങ്ങനെ ശുചിത്വവും ആരോഗ്യമുള്ളതുമായിരിക്കാൻ കഴിയും?
-മാനസിക പ്രശ്നങ്ങൾക്ക് നിർദേശങ്ങൾ എവിടെ ലഭിക്കും?
-മാസിക ശുചിത്വത്തിന്റെ മികച്ച പ്രവർത്തനങ്ങളേതെല്ലാം?

നിങ്ങൾ എനിക്ക് നിങ്ങളുടെ നിർദ്ദേശങ്ങൾ ആവശ്യമായ എന്തും ചോദിക്കാം. നിങ്ങൾ ടൈപ്പ് ചെയ്യാവുന്നതോ അല്ലെങ്കിൽ സംസാരിക്കാവുന്നതോ ആണ്.
"""

    },
    "mr": {
        "story": """
कथेत आपले स्वागत आहे सखी!
तुम्ही जे मागता त्याबद्दल मी तुमच्यासाठी एक कथा तयार करू शकतो.

उदाहरणार्थ:
- मी एका मुलीची गोष्ट सांगू शकतो जिने पहिल्यांदा समुद्र पाहिला.
- मी माकड आणि बेडूक बद्दल एक कथा सांगू शकतो

तुम्हाला पाहिजे असलेल्या कोणत्याही गोष्टीबद्दल मला विचारा. तुम्ही टाइप करू शकता किंवा बोलू शकता.
""",
        "teacher": """
शिक्षक तारामध्ये आपले स्वागत आहे!
मी तुम्हाला असे उपक्रम सुचवू शकतो जे तुम्ही तुमच्या विद्यार्थ्यांसोबत (वय 3 ते 8 वर्षे) शाळांमध्ये करू शकता.
फाऊंडेशनल स्टेजसाठी नवीन NCF मध्ये सुचवलेल्या नाटकावर आधारित शिक्षणाबद्दल मी तुमच्या प्रश्नांची उत्तरे देखील देऊ शकतो.
तुम्ही काय विचारू शकता याची काही उदाहरणे येथे आहेत.

उदाहरणे:
- वर्गीकरण किंवा संख्या मोजणे शिकवण्यासाठी मी विद्यार्थ्यांसोबत कोणती क्रिया करू शकतो
- विशेष गरजा असलेल्या मुलांसोबत मी माझा वर्ग कसा आयोजित करू शकतो
- नेहमी विचलित असलेल्या मुलाला व्यस्त ठेवण्यासाठी मी काय करू शकतो.

मी नवीन NCF बद्दल तुमच्या प्रश्नांची उत्तरे देऊ शकतो
तुम्हाला पाहिजे असलेल्या कोणत्याही गोष्टीबद्दल मला विचारा. तुम्ही टाइप करू शकता किंवा बोलू शकता.
""",
        "parent": """
पालक तारामध्ये आपले स्वागत आहे!
मी तुम्हाला असे उपक्रम सुचवू शकतो जे तुम्ही तुमच्या मुलांसोबत घरी करू शकता. तुम्ही काय विचारू शकता याची काही उदाहरणे येथे आहेत:

उदाहरणे:
- तुमच्या स्वयंपाकघरातील भाज्या वापरून मी माझ्या मुलासोबत कोणती क्रिया करू शकतो
- मी माझ्या मुलाला घरगुती कामात रस कसा निर्माण करू शकतो ते सुचवा
- माझे मूल पौष्टिक अन्न खात नाही, काय करावे

तुम्हाला पाहिजे असलेल्या कोणत्याही गोष्टीबद्दल मला विचारा. तुम्ही टाइप करू शकता किंवा बोलू शकता.
""",
        "prayas": """
प्रयास एआय सहाय्यकात आपले स्वागत आहे!
मी तुम्हाला तुमच्या शरीराबद्दल शिकण्यात, पौगंडावस्थेतील बदल समजून घेण्यात, आणि भावनिक व लैंगिक आरोग्यासाठी सहाय्य मिळविण्यात मदत करू शकतो.
येथे काही उदाहरणे दिली आहेत जी तुम्ही विचारू शकता:
-पौगंडावस्थेत कोणते बदल अपेक्षित असावेत?
-माझे वय वाढत असताना मी स्वच्छ आणि निरोगी कसा राहू?
-भावनिक समस्यांसाठी मला सल्ला कुठे मिळेल?
-मासिक पाळीच्या स्वच्छतेसाठी सर्वोत्तम पद्धती कोणत्या आहेत?

आपण मला काहीही विचारू शकता ज्यासाठी आपल्याला माझ्याकडून सूचना हवी आहेत. तुम्ही टाइप करू शकता किंवा बोलू शकता.
"""

    },
    "or": {
        "story": """
କାହାଣୀ ସାଖୀକୁ ସ୍ୱାଗତ!
ତୁମେ ଯାହା ବିଷୟରେ ଚାହିଁବ ମୁଁ ତୁମ ପାଇଁ ଏକ କାହାଣୀ ସୃଷ୍ଟି କରିପାରିବି |

ଉଦାହରଣ ସ୍ଵରୁପ:
- ମୁଁ ଏକ ଝିଅ ବିଷୟରେ ଗୋଟିଏ କାହାଣୀ କହିପାରେ ଯିଏ ପ୍ରଥମ ଥର ସମୁଦ୍ର ଦେଖିଲା |
- ମୁଁ ଏକ ମାଙ୍କଡ଼ ଏବଂ ବେଙ୍ଗ ବିଷୟରେ ଗୋଟିଏ କାହାଣୀ କହିପାରେ |

ଆପଣ ଚାହୁଁଥିବା କିଛି ବିଷୟରେ ମୋତେ ପଚାର | ଆପଣ ଟାଇପ୍ କରିପାରିବେ କିମ୍ବା କହିପାରିବେ।
""",
        "teacher": """
ଶିକ୍ଷକ ସଖୀଙ୍କୁ ସ୍ୱାଗତ!
ମୁଁ ତୁମକୁ କିଛି କାର୍ଯ୍ୟକଳାପ ବାବଦରେ ପରାମର୍ଶ ଦେଇପାରେ ଯାହା ତୁମେ ତୁମର ଛାତ୍ରମାନଙ୍କ ସହିତ (3 ରୁ 8 ବର୍ଷ ବୟସ) ବିଦ୍ୟାଳୟରେ କରିପାରିବ |
ଫାଉଣ୍ଡେସନ ଷ୍ଟେଜ୍ ପାଇଁ ନୂତନ ଏନସିଏଫ୍ ରେ ପରାମର୍ଶ ଦିଆଯାଇଥିବା ନାଟକ ଭିତ୍ତିକ ଶିକ୍ଷା ବିଷୟରେ ମୁଁ ମଧ୍ୟ ତୁମର ପ୍ରଶ୍ନର ଉତ୍ତର ଦେଇପାରେ |
ଆପଣ ଯାହା ପଚାରିପାରିବେ ଏହାର କିଛି ଉଦାହରଣ ଏଠାରେ ଅଛି |

ଉଦାହରଣଗୁଡିକ:
- ସଂଖ୍ୟାଗୁଡିକ ସର୍ଟ କରିବା କିମ୍ବା ଗଣନା କରିବା ପାଇଁ ମୁଁ ଛାତ୍ରମାନଙ୍କ ସହିତ କ’ଣ କାର୍ଯ୍ୟକଳାପ କରିପାରିବି ?
- ବିଶେଷ ଆବଶ୍ୟକତା ଥିବା ପିଲାମାନଙ୍କ ସହିତ ମୁଁ କିପରି ମୋ ଶ୍ରେଣୀ ପରିଚାଳନା କରିପାରିବି ?
- ସବୁବେଳେ ବିଭ୍ରାନ୍ତ ହେଉଥିବା ପିଲାଙ୍କୁ ନିୟୋଜିତ କରିବା ପାଇଁ ମୁଁ କ’ଣ କରିପାରିବି?

ମୁଁ ନୂତନ NCF ବିଷୟରେ ତୁମର ପ୍ରଶ୍ନର ଉତ୍ତର ଦେଇପାରେ |
ତୁମେ ଚାହୁଁଥିବା କିଛି ବି ବିଷୟରେ ମୋତେ ପଚାର | ଆପଣ ଟାଇପ୍ କରିପାରିବେ କିମ୍ବା କହିପାରିବେ।
""",
        "parent": """
ପିତାମାତା ସାହିଙ୍କୁ ସ୍ୱାଗତ!
ମୁଁ ତୁମକୁ ଏପରି କାର୍ଯ୍ୟକଳାପକୁ ପରାମର୍ଶ ଦେଇପାରେ ଯାହା ତୁମେ ତୁମର ପିଲାମାନଙ୍କ ସହିତ ଘରେ କରିପାରିବ | ଆପଣ ଯାହା ପଚାରିପାରିବେ ଏହାର କିଛି ଉଦାହରଣ ଏଠାରେ ଅଛି:

ଉଦାହରଣଗୁଡିକ:
- ତୁମ ରୋଷେଇ ଘରେ ପନିପରିବା ବ୍ୟବହାର କରି ମୋ ପିଲା ସହିତ ମୁଁ କ’ଣ କାର୍ଯ୍ୟକଳାପ କରିପାରିବି |
- ମୁଁ କିପରି ମୋ ପିଲାକୁ ଘରର କାର୍ଯ୍ୟକଳାପରେ ଆଗ୍ରହୀ କରିପାରିବି ପରାମର୍ଶ ଦିଅନ୍ତୁ |
- ମୋ ପିଲା ପୁଷ୍ଟିକର ଖାଦ୍ୟ ଖାଏ ନାହିଁ, କଣ କରିବା ଉଚିତ୍ |

ତୁମେ ଚାହୁଁଥିବା କିଛି ବିଷୟରେ ମୋତେ ପଚାର | ଆପଣ ଟାଇପ୍ କରିପାରିବେ କିମ୍ବା କହିପାରିବେ।
""",
        "prayas": """
ପ୍ରୟାସ ଏଆଇ ସହାୟକକୁ ସ୍ୱାଗତ!
ମୁଁ ଆପଣଙ୍କୁ ଆପଣଙ୍କର ଶରୀର ବିଷୟରେ ଜାଣିବାରେ, ବାଲ୍ୟାବସ୍ଥାରେ ହେଉଥିବା ପରିବର୍ତ୍ତନକୁ ବୁଝିବାରେ, ଏବଂ ଭାବନା ଓ ଯୌନ ସ୍ୱାସ୍ଥ୍ୟ ପାଇଁ ସହାୟତା ମିଳିବାରେ ସାହାଯ୍ୟ କରିପାରେ।
ଏଠାରେ କିଛି ଉଦାହରଣ ରହିଛି ଯାହା ଆପଣ ଜିଜ୍ଞାସା କରିପାରିବେ:
-ବାଲ୍ୟାବସ୍ଥାରେ ମୁଁ କେଉଁ ପରିବର୍ତ୍ତନ ଆଶା କରିପାରେ?
-ମୁଁ ବଡ ହେଉଥିବାବେଳେ କିପରି ପରିସ୍କାର ଏବଂ ସ୍ୱାସ୍ଥ୍ୟକର ରହିପାରେ?
-ଭାବନାର ସମସ୍ୟା ପାଇଁ ମୁଁ କେଉଁଠାରୁ ପରାମର୍ଶ ପାଇପାରେ?
-ମାସିକ ସ୍ୱାସ୍ଥ୍ୟ ରକ୍ଷା ପାଇଁ ସର୍ବୋତ୍ତମ ପଦ୍ଧତିଗୁଡ଼ିକ କେଉଁଗୁଡ଼ିକ?

ଆପଣ ମୋତେ ଯାହାକି ଆପଣ ମୋତେ ପ୍ରସ୍ତାବ କରିବାକୁ ଚାହୁଁଛନ୍ତି ତାହା ସମ୍ବନ୍ଧରେ ଯେକୋଣସି ଥିଲେ ପଚାରିପାରିବେ। ଆପଣ ଟାଇପ କରିପାରିବେ କିମ୍ବା କହିପାରିବେ।
"""

    },
    "pa": {
        "story": """
ਕਹਾਣੀ ਸਖੀ ਵਿੱਚ ਤੁਹਾਡਾ ਸੁਆਗਤ ਹੈ!
ਮੈਂ ਤੁਹਾਡੇ ਲਈ ਇੱਕ ਕਹਾਣੀ ਬਣਾ ਸਕਦਾ ਹਾਂ ਜੋ ਤੁਸੀਂ ਚਾਹੁੰਦੇ ਹੋ । 

ਉਦਾਹਰਨ ਲਈ: 
- ਮੈਂ ਉਸ ਕੁੜੀ ਦੀ ਕਹਾਣੀ ਦੱਸ ਸਕਦਾ ਹਾਂ ਜਿਸ ਨੇ ਪਹਿਲੀ ਵਾਰ ਸਮੁੰਦਰ ਦੇਖਿਆ ਸੀ । 
- ਮੈਂ ਇੱਕ ਬਾਂਦਰ ਅਤੇ ਡੱਡੂ ਬਾਰੇ ਇੱਕ ਕਹਾਣੀ ਦੱਸ ਸਕਦਾ ਹਾਂ 

ਜੋ ਵੀ ਤੁਸੀਂ ਚਾਹੁੰਦੇ ਹੋ ਉਸ ਬਾਰੇ ਮੈਨੂੰ ਪੁੱਛੋ । ਤੁਸੀਂ ਟਾਈਪ ਕਰ ਸਕਦੇ ਹੋ ਜਾਂ ਬੋਲ ਸਕਦੇ ਹੋ ।
""",
        "teacher": """
ਸੁਆਗਤ ਹੈ ਅਧਿਆਪਕ ਸਖੀ !
ਮੈਂ ਤੁਹਾਨੂੰ ਉਹਨਾਂ ਗਤੀਵਿਧੀਆਂ ਦਾ ਸੁਝਾਅ ਦੇ ਸਕਦਾ ਹਾਂ ਜੋ ਤੁਸੀਂ ਸਕੂਲਾਂ ਵਿੱਚ ਆਪਣੇ ਵਿਦਿਆਰਥੀਆਂ (3 ਤੋਂ 8 ਸਾਲ ਦੀ ਉਮਰ ਦੇ) ਨਾਲ਼ ਕਰ ਸਕਦੇ ਹੋ । 
ਮੈਂ ਬੁਨਿਆਦੀ ਪੜਾਅ ਲਈ ਨਵੇਂ ਐੱਨ.ਸੀ.ਐੱਫ. ਵਿੱਚ ਸੁਝਾਈ ਗਈ ਨਾਟਕ ਆਧਾਰਿਤ ਸਿਖਲਾਈ ਬਾਰੇ ਤੁਹਾਡੇ ਸਵਾਲਾਂ ਦੇ ਜਵਾਬ ਵੀ ਦੇ ਸਕਦਾ ਹਾਂ ।
ਇੱਥੇ ਕੁਝ ਉਦਾਹਰਨਾਂ ਹਨ ਜੋ ਤੁਸੀਂ ਪੁੱਛ ਸਕਦੇ ਹੋ ।

ਉਦਾਹਰਨਾਂ:
- ਸੰਖਿਆਵਾਂ ਦੀ ਛਾਂਟੀ ਜਾਂ ਗਿਣਤੀ ਸਿਖਾਉਣ ਲਈ ਮੈਂ ਵਿਦਿਆਰਥੀਆਂ ਨਾਲ਼ ਕਿਹੜੀ ਗਤੀਵਿਧੀ ਕਰ ਸਕਦਾ ਹਾਂ
- ਮੈਂ ਵਿਸ਼ੇਸ਼ ਲੋੜਾਂ ਵਾਲ਼ੇ ਬੱਚਿਆਂ ਨਾਲ਼ ਆਪਣੀ ਕਲਾਸ ਕਿਵੇਂ ਚਲਾ ਸਕਦਾ ਹਾਂ
- ਮੈਂ ਉਸ ਬੱਚੇ ਦੇ ਰੁਝੇਵੇਂ ਲਈ ਕੀ ਕਰ ਸਕਦਾ ਹਾਂ ਜੋ ਹਮੇਸ਼ਾ ਵਿਚਲਿਤ ਰਹਿੰਦਾ ਹੈ ।

ਮੈਂ ਨਵੇਂ ਐੱਨ.ਸੀ.ਐੱਫ. ਬਾਰੇ ਤੁਹਾਡੇ ਸਵਾਲਾਂ ਦੇ ਜਵਾਬ ਦੇ ਸਕਦਾ/ਸਕਦੀ ਹਾਂ
ਜੋ ਵੀ ਤੁਸੀਂ ਚਾਹੁੰਦੇ ਹੋ ਉਸ ਬਾਰੇ ਮੈਨੂੰ ਪੁੱਛੋ । ਤੁਸੀਂ ਟਾਈਪ ਕਰ ਸਕਦੇ ਹੋ ਜਾਂ ਬੋਲ ਸਕਦੇ ਹੋ ।
""",
        "parent": """
ਮਾਪੇ ਸਖੀ ਵਿੱਚ ਸੁਆਗਤ ਹੈ!
ਮੈਂ ਤੁਹਾਨੂੰ ਅਜਿਹੀਆਂ ਗਤੀਵਿਧੀਆਂ ਦਾ ਸੁਝਾਅ ਦੇ ਸਕਦਾ ਹਾਂ ਜੋ ਤੁਸੀਂ ਆਪਣੇ ਬੱਚਿਆਂ ਨਾਲ਼ ਘਰ ਵਿੱਚ ਕਰ ਸਕਦੇ ਹੋ । ਇੱਥੇ ਕੁਝ ਉਦਾਹਰਨਾਂ ਹਨ ਜੋ ਤੁਸੀਂ ਪੁੱਛ ਸਕਦੇ ਹੋ: 

ਉਦਾਹਰਨਾਂ:
- ਤੁਹਾਡੀ ਰਸੋਈ ਵਿੱਚ ਸਬਜ਼ੀਆਂ ਦੀ ਵਰਤੋਂ ਕਰਦੇ ਹੋਏ ਮੈਂ ਆਪਣੇ ਬੱਚੇ ਨਾਲ਼ ਕਿਹੜੀ ਗਤੀਵਿਧੀ ਕਰ ਸਕਦਾ/ਸਕਦੀ ਹਾਂ 
- ਸੁਝਾਅ ਦਿਓ ਕਿ ਮੈਂ ਆਪਣੇ ਬੱਚੇ ਦੀ ਘਰੇਲੂ ਗਤੀਵਿਧੀਆਂ ਵਿੱਚ ਰੁਚੀ ਕਿਵੇਂ ਬਣਾ ਸਕਦਾ/ਸਕਦੀ ਹਾਂ 
- ਮੇਰਾ ਬੱਚਾ ਪੌਸ਼ਟਿਕ ਭੋਜਨ ਨਹੀਂ ਖਾਂਦਾ, ਕੀ ਕਰਨਾ ਚਾਹੀਦਾ ਹੈ

ਜੋ ਵੀ ਤੁਸੀਂ ਚਾਹੁੰਦੇ ਹੋ ਉਸ ਬਾਰੇ ਮੈਨੂੰ ਪੁੱਛੋ । ਤੁਸੀਂ ਟਾਈਪ ਕਰ ਸਕਦੇ ਹੋ ਜਾਂ ਬੋਲ ਸਕਦੇ ਹੋ ।
""",
        "prayas": """
ਪ੍ਰਯਾਸ ਏਆਈ ਸਹਾਇਕ ਵਿੱਚ ਤੁਹਾਡਾ ਸਵਾਗਤ ਹੈ!
ਮੈਂ ਤੁਹਾਡੀ ਮਦਦ ਕਰ ਸਕਦਾ ਹਾਂ ਤੁਹਾਡੇ ਸਰੀਰ ਬਾਰੇ ਸਿੱਖਣ ਵਿੱਚ, ਬਾਲਗ ਹੋਣ ਦੌਰਾਨ ਹੋਣ ਵਾਲੇ ਬਦਲਾਅ ਸਮਝਣ ਵਿੱਚ, ਅਤੇ ਭਾਵਨਾਤਮਕ ਅਤੇ ਯੌਨ ਸਿਹਤ ਲਈ ਸਮਰਥਨ ਲੱਭਣ ਵਿੱਚ।
ਇਥੇ ਕੁਝ ਉਦਾਹਰਨਾਂ ਹਨ ਜਿਹੜੀਆਂ ਤੁਸੀਂ ਪੁੱਛ ਸਕਦੇ ਹੋ:
-ਬਾਲਗ ਹੋਣ ਦੌਰਾਨ ਮੈਂ ਕਿਹੜੇ ਬਦਲਾਅ ਦੀ ਉਮੀਦ ਕਰ ਸਕਦਾ ਹਾਂ?
-ਜਦੋਂ ਮੈਂ ਵੱਡਾ ਹੁੰਦਾ ਹਾਂ, ਤਾਂ ਮੈਂ ਸਾਫ ਅਤੇ ਸਿਹਤਮੰਦ ਕਿਵੇਂ ਰਹਿ ਸਕਦਾ ਹਾਂ?
-ਭਾਵਨਾਤਮਕ ਸਮੱਸਿਆਵਾਂ ਲਈ ਮੈਨੂੰ ਕਿੱਥੋਂ ਸਲਾਹਕਾਰ ਮਿਲ ਸਕਦਾ ਹੈ?
-ਮਹਾਵਾਰੀ ਸਫਾਈ ਲਈ ਸਰਬੋਤਮ ਅਭਿਆਸ ਕੀ ਹਨ?

ਤੁਸੀਂ ਮੈਨੂੰ ਕੁਝ ਵੀ ਪੁੱਛ ਸਕਦੇ ਹੋ ਜੋ ਤੁਸੀਂ ਮੈਨੂੰ ਸੁਝਾਉਣ ਲਈ ਕਹਿਣਾ ਚਾਹੁੰਦੇ ਹੋ। ਤੁਸੀਂ ਟਾਈਪ ਕਰ ਸਕਦੇ ਹੋ ਜਾਂ ਬੋਲ ਸਕਦੇ ਹੋ।
"""

    },
    "ta": {
        "story": """
கதை சகிக்கு வரவேற்கிறோம்!
நீங்கள் கேட்பதைக் கொண்டு உங்களுக்காக ஒரு கதையை என்னால் உருவாக்க முடியும்.

எடுத்துக்காட்டு:
- முதன்முறையாகக் கடலைப் பார்த்த ஒரு பெண்ணைப் பற்றிய கதையை என்னால் சொல்ல முடியும்.
- நான் ஒரு குரங்கு மற்றும் ஒரு தவளை பற்றிய கதை சொல்ல முடியும்

நீங்கள் விரும்பும் எதையும் என்னிடம் கேளுங்கள். நீங்கள் தட்டச்சு செய்யலாம் அல்லது பேசலாம்.
""",
        "teacher": """
டீச்சர் தாராவை வரவேற்கிறோம்!
பள்ளிகளில் உங்கள் மாணவர்களுடன் (3 முதல் 8 வயது வரை) நீங்கள் செய்யக்கூடிய செயல்பாடுகளை நான் உங்களுக்குப் பரிந்துரைக்க முடியும்.
புதிய NCFஇல் அடித்தள நிலையில் பரிந்துரைக்கப்பட்ட விளையாட்டு அடிப்படையிலான கற்றல் பற்றிய உங்கள் கேள்விகளுக்கும் என்னால் பதிலளிக்க முடியும்.
நீங்கள் கேட்கக்கூடிய சில எடுத்துக்காட்டு இங்கே.

எடுத்துக்காட்டு:
- மாணவர்கள் எண்களை வரிசைப்படுத்தவும் அல்லது எண்ணவும் கற்பிப்பதற்கு நான் என்ன நடவடிக்கை எடுக்க முடியும்
- சிறப்புத் தேவைகள் உள்ள குழந்தைகளுக்கு எனது வகுப்பை எவ்வாறு நடத்துவது?
- எப்போதும் கவனச்சிதறலுடன் இருக்கும் குழந்தையை ஈடுபடுத்த நான் என்ன செய்ய வேண்டும்?

புதிய NCF பற்றிய உங்கள் கேள்விகளுக்கு என்னால் பதிலளிக்க முடியும்
நீங்கள் விரும்பும் எதையும் என்னிடம் கேளுங்கள். நீங்கள் தட்டச்சு செய்யலாம் அல்லது பேசலாம்.
""",
        "parent": """
பெற்றோர் தாராவை வரவேற்கிறோம்!
வீட்டில் உங்கள் குழந்தைகளுடன் நீங்கள் செய்யக்கூடிய செயல்பாடுகளை நான் உங்களுக்கு பரிந்துரைக்க முடியும். 
நீங்கள் கேட்கக்கூடிய சில எடுத்துக்காட்டு இங்கே:

எடுத்துக்காட்டு:
- உங்கள் சமையலறையில் காய்கறிகளைப் பயன்படுத்தி என் குழந்தையுடன் என்ன செயல்பாடுகள் செய்ய முடியும்?
- வீட்டுச் செயல்பாடுகளில் எனது குழந்தைக்கு எப்படி ஆர்வத்தை ஏற்படுத்துவது என்று பரிந்துரைக்கவும். 
- என் குழந்தை சத்தான உணவு சாப்பிடுவதில்லை, என்ன செய்வது?

நீங்கள் விரும்பும் எதையும் என்னிடம் கேளுங்கள். நீங்கள் தட்டச்சு செய்யலாம் அல்லது பேசலாம்.
""",
        "prayas": """
ப்ரயாஸ் ஏஐ உதவியாளருக்கு வரவேற்கிறோம்!
உங்கள் உடலைப் பற்றி அறிந்து கொள்வதில், இளமையை நுகரும் காலத்தில் ஏற்படும் மாற்றங்களைப் புரிந்து கொள்வதில், மற்றும் உணர்ச்சியியல் மற்றும் பாலியல் ஆரோக்கியத்திற்கு ஆதரவு பெறுவதில் நான் உங்களுக்கு உதவ முடியும்.
நீங்கள் கேட்கக்கூடிய சில உதாரணங்கள் இங்கு உள்ளன:
-இளமையை நுகரும் காலத்தில் என்ன மாற்றங்களை எதிர்பார்க்க வேண்டும்?
-நான் வளரும்போது சுத்தமாகவும் ஆரோக்கியமாகவும் எப்படி இருக்கலாம்?
-உணர்ச்சியியல் சிக்கல்களுக்கு நான் எங்கு ஆலோசனைப் பெறலாம்?
-மாதவிடாய் சுகாதாரத்திற்கு சிறந்த வழிமுறைகள் என்ன?

நீங்கள் என்னிடம் ஏதேனும் உங்களுக்குத் தேவையான ஆலோசனையைப் பற்றிக் கேள்வி கேட்கலாம். நீங்கள் தட்டச்சு செய்யவோ அல்லது பேசவோ முடியும்.
"""

    },
    "te": {
        "story": """
కథా సఖికి స్వాగతం!
మీరు అడిగిన విషయాన్ని గురించి నేను కొత్త కథను సృష్టించగలను.

ఉదాహరణకి:
- సముద్రాన్ని మొదటిసారి చూసిన ఒక అమ్మాయి గురించి ఒక కథ చెప్పగలను.
- కోతి, కప్ప గురించి ఒక కథ చెప్పగలను

మీకు దేని గురించి కథ కావాలో అడగండి. మీరు టైప్ చేయవచ్చు లేదా మాట్లాడవచ్చు.
""",
        "teacher": """
టీచర్ తారాకి స్వాగతం! 
పాఠశాలల్లో మీ విద్యార్థులతో (3 నుండి 8 సంవత్సరాల వయస్సు పిల్లలు) మీరు చేయగలిగే కార్యకలాపాలను నేను మీకు సూచించగలను. 
ఫౌండేషన్ స్టేజ్ కోసం కొత్త NCFలో సూచించిన ప్లే బేస్డ్ లెర్నింగ్ గురించి కూడా మీ ప్రశ్నలకు నేను సమాధానం చెప్పగలను. మీరు ఇలాంటి ప్రశ్నలు అడగవచ్చు. 

ఉదాహరణలు:
- సంఖ్యలను క్రమబద్ధీకరించడం లేదా లెక్కించడం, బోధించడానికి నేను విద్యార్థులతో ఏ కార్యకలాపాన్ని చేయగలను.
- ప్రత్యేక అవసరాలు ఉన్న పిల్లలతో నేను నా తరగతిని ఎలా నిర్వహించగలను.
- ఎప్పుడూ పరధ్యానంగా ఉండే పిల్లవాడిని ఎంగేజ్ చేయడానికి నేను ఏమి చేయగలను.

కొత్త NCF గురించి మీ ప్రశ్నలకు నేను సమాధానం చెప్పగలను. 
మీకు కావలసిన దాని గురించి నన్ను అడగండి. మీరు టైప్ చేయవచ్చు లేదా మాట్లాడవచ్చు.
""",
        "parent": """
పేరెంట్ తారాకి స్వాగతం!
మీరు ఇంట్లో మీ పిల్లలతో చేయగలిగే కార్యకలాపాలను నేను మీకు సూచించగలను. 

మీరు అడగడానికి ఇక్కడ కొన్ని ఉదాహరణలు ఉన్నాయి:
- మీ వంటగదిలోని కూరగాయలను ఉపయోగించి నా బిడ్డతో నేను ఏ కార్యకలాపాన్ని చేయగలను
- ఇంటి కార్యకలాపాలపై నా బిడ్డకు ఆసక్తిని కలిగించడం ఎలాగో సూచించండి
- నా బిడ్డ పౌష్టికాహారం తినడు, ఏం చేయాలి
 
మీకు కావలసిన దాని గురించి నన్ను అడగండి. మీరు టైప్ చేయవచ్చు లేదా మాట్లాడవచ్చు.
""",
        "prayas": """
ప్రయాస్ ఏఐ సహాయకుడికి స్వాగతం!
మీ శరీరాన్ని గురించి నేర్చుకోవడంలో, వయస్సు పెరుగుతున్నప్పుడు మార్పులను అర్థం చేసుకోవడంలో, మరియు భావోద్వేగ మరియు లైంగిక ఆరోగ్యానికి మద్దతు పొందడంలో నేను మీకు సహాయపడగలను.
మీరు అడగగల కొన్ని ఉదాహరణలు ఇక్కడ ఉన్నాయి:
-వయస్సు పెరుగుతున్నప్పుడు నేను ఏ మార్పులను ఆశించాలి?
-నేను పెరుగుతున్నప్పుడు పరిశుభ్రంగా మరియు ఆరోగ్యంగా ఎలా ఉండాలి?
-భావోద్వేగ సమస్యల కోసం కౌన్సెలింగ్ ఎక్కడ పొందవచ్చు?
-మాసిక పరిశుభ్రతకు ఉత్తమ పద్ధతులు ఏమిటి?

మీకు ఏ విషయంపై నా సూచనలు కావాలో అడగండి. మీరు టైప్ చేయవచ్చు లేదా మాట్లాడవచ్చు.
"""

    }
}

BOT_LODING_MSG = {
    "en": "Please wait, crafting response. It might take upto a minute.",
    "hi": "कृपया प्रतीक्षा करें, प्रतिक्रिया तैयार कर रहा हूँ। इसमें एक मिनट तक का समय लग सकता है",
    "bn" : "অনুগ্রহ করে অপেক্ষা করুন, উত্তর তৈরি করুন। এটি এক মিনিট পর্যন্ত সময় নিতে পারে।",
    "gu" : "કૃપા કરીને રાહ જુઓ, પ્રતિસાદ તૈયાર કરો. તેમાં એક મિનિટ જેટલો સમય લાગી શકે છે.",
    "kn" : "ದಯವಿಟ್ಟು ನಿರೀಕ್ಷಿಸಿ, ಪ್ರತಿಕ್ರಿಯೆಯನ್ನು ರಚಿಸುವುದು. ಇದು ಒಂದು ನಿಮಿಷದವರೆಗೆ ತೆಗೆದುಕೊಳ್ಳಬಹುದು.",
    "ml" : "ദയവായി കാത്തിരിക്കുക, പ്രതികരണം തയ്യാറാക്കുക. ഇതിന് ഒരു മിനിറ്റ് വരെ എടുത്തേക്കാം.",
    "mr" : "कृपया प्रतीक्षा करा, प्रतिसाद तयार करा. यास एक मिनिट लागू शकतो.",
    "or" : "ଦୟାକରି ଅପେକ୍ଷା କରନ୍ତୁ, କ୍ରାଫ୍ଟିଙ୍ଗ୍ ପ୍ରତିକ୍ରିୟା | ଏହା ଏକ ମିନିଟ୍ ପର୍ଯ୍ୟନ୍ତ ନେଇପାରେ |",
    "pa" : "ਕਿਰਪਾ ਕਰਕੇ ਉਡੀਕ ਕਰੋ, ਜਵਾਬ ਤਿਆਰ ਕਰੋ। ਇਸ ਵਿੱਚ ਇੱਕ ਮਿੰਟ ਤੱਕ ਦਾ ਸਮਾਂ ਲੱਗ ਸਕਦਾ ਹੈ।",
    "ta" : "தயவுசெய்து காத்திருக்கவும், பதிலை உருவாக்கவும். இது ஒரு நிமிடம் வரை ஆகலாம்.",
    "te" : "దయచేసి వేచి ఉండండి. జవాబు రూపొందించడానికి ఒక నిమిషం వరకు పట్టవచ్చు."
}

API_ERROR_MSG = {
    "en": "An unknown error occured, please try after sometime",
    "hi": "कोई अज्ञात त्रुटि उत्पन्न हुई, कृपया कुछ देर बाद प्रयास करें",
    "bn": "একটি অজানা ত্রুটি ঘটেছে, অনুগ্রহ করে কিছুক্ষণ পরে চেষ্টা করুন৷",
    "gu": "એક અજાણી ભૂલ આવી, કૃપા કરીને થોડીવાર પછી પ્રયાસ કરો",
    "kn": "ಅಜ್ಞಾತ ದೋಷ ಸಂಭವಿಸಿದೆ, ದಯವಿಟ್ಟು ಸ್ವಲ್ಪ ಸಮಯದ ನಂತರ ಪ್ರಯತ್ನಿಸಿ",
    "ml": "ഒരു അജ്ഞാത പിശക് സംഭവിച്ചു, കുറച്ച് കഴിഞ്ഞ് ശ്രമിക്കുക",
    "mr": "एक अज्ञात त्रुटी आली, कृपया काही वेळानंतर प्रयत्न करा",
    "or": "ଏକ ଅଜ୍ଞାତ ତ୍ରୁଟି ଘଟିଗଲା, ଦୟାକରି କିଛି ସମୟ ପରେ ଚେଷ୍ଟା କରନ୍ତୁ |",
    "pa": "ਇੱਕ ਅਗਿਆਤ ਤਰੁੱਟੀ ਆਈ ਹੈ, ਕਿਰਪਾ ਕਰਕੇ ਕੁਝ ਸਮੇਂ ਬਾਅਦ ਕੋਸ਼ਿਸ਼ ਕਰੋ",
    "ta": "அறியப்படாத பிழை ஏற்பட்டது, சிறிது நேரம் கழித்து முயற்சிக்கவும்",
    "te": "ఏదో ఇబ్బంది సంభవించింది, దయచేసి కొంత సమయం తర్వాత ప్రయత్నించండి"
}

LANGUAGES = [
    {"text": "English", "code": "en", "index": 1},
    {"text": "বাংলা", "code": "bn", "index": 2},
    {"text": "ગુજરાતી", "code": "gu", "index": 3},
    {"text": "हिंदी", "code": "hi", "index": 4},
    {"text": "ಕನ್ನಡ", "code": "kn", "index": 5},
    {"text": "മലയാളം ", "code": "ml", "index": 6},
    {"text": "मराठी", "code": "mr", "index": 7},
    {"text": "ଓଡ଼ିଆ", "code": "or", "index": 8},
    {"text": "ਪੰਜਾਬੀ", "code": "pa", "index": 9},
    {"text": "தமிழ்", "code": "ta", "index": 10},
    {"text": "తెలుగు", "code": "te", "index": 11}
]